app/controllers/cat_rental_requests_controller.rb

  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    @rental_request.user_id = current_user.id

    if cat_owner == current_user
      flash.now[:errors] = ["STOP FOOLING!"]
      render :new
    elsif @rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 1], ["created_at", "2016-09-07 20:58:55.104722"], ["end_date", "2016-09-30"], ["start_date", "2016-09-29"], ["status", "PENDING"], ["updated_at", "2016-09-07 20:58:55.104722"]]