app/views/cats/_req_tr.html.erb

<tr>
  <td><%= User.find(req.user_id).user_name %></td>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]